## How do I remove columns from a pandas DataFrame?

In [1]:
import pandas as pd
import ssl

In [2]:
ssl._create_default_https_context = ssl._create_unverified_context

In [56]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [57]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [58]:
ufo.shape

(18241, 5)

drop 1 column

In [59]:
ufo.drop('Colors Reported', axis=1, inplace=True)

In [60]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

Drop more than 1 column

In [61]:
ufo.drop(['City', 'State'], axis=1, inplace=True)

In [62]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

What if you need remove rows instead columns

In [63]:
ufo.drop([0, 1], axis=0, inplace=True)

In [64]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

In [65]:
ufo.shape

(18239, 2)

Another approach, utilizing slices

In [66]:
ufo.drop(ufo.index[:5], axis=0, inplace=True)  # delete the first 5 rows indexes (2, 3, 4, 5, 6)

In [67]:
ufo.head()

   Shape Reported              Time
7            DISK    7/15/1936 0:00
8           CIGAR  10/15/1936 17:00
9        CYLINDER    6/15/1937 0:00
10          LIGHT   8/15/1937 21:00
11       FIREBALL    6/1/1939 20:00

using conditions

rem_cond=(ufo.time=='6/1/1930 22:00') | (ufo.time=='6/30/1930 20:00')

ufo.drop(ufo[rem_cond].index,axis=0,inplace=True)

### Best way to drop every non-numeric column from a DataFrame

In [3]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [4]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [6]:
import numpy as np

drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object